#+latex_header: \usepackage{homework}
#+title: EE466 Fall 2019 HW \jobname
#+author: Lewis Collum (0621539) EE/CE
#+date: Due: September 25, 2019

* 1.7.b
#+BEGIN_SRC python :results output :exports both
class Compiler:
    def __init__(self, instructions, executionTime):
        self.instructions = instructions
        self.executionTime = executionTime

    @property
    def instructionRate(self):
        return self.instructions / self.executionTime

compilers = {
    'A': Compiler(
        instructions = 1.0e9,
        executionTime = 1.1),
    'B': Compiler(
        instructions = 1.2e9,
        executionTime = 1.5)
}

instructionRateRatio = compilers['A'].instructionRate / compilers['B'].instructionRate
print((f"Compiler A's processor has a clock that is {instructionRateRatio:.2}"
       f" times faster than Compiler B's processor"))
#+END_SRC

#+RESULTS:
: Compiler A's processor has a clock that is 1.1 faster than Compiler B's processor

* 1.8.2
#+name: 1.8.2_table
| Processor Name     | Clock Rate (GHz) | Voltage (V) | Static Power (W) | Dynamic Power (W) |
|--------------------+------------------+-------------+------------------+-------------------|
| Pentium 4 Prescott |              3.6 |        1.25 |               10 |                90 |
| Core i5 Ivy Bridge |              3.4 |         0.9 |               30 |                40 |

#+BEGIN_SRC python :results output :var table=1.8.2_table :exports both
from collections import namedtuple
Processor = namedtuple('Processor', ['clockRate', 'voltage', 'staticPower', 'dynamicPower'])
processors = {row[0]: Processor(*row[1:]) for row in table}

for name, processor in processors.items():
    totalPower = processor.staticPower + processor.dynamicPower
    staticPowerPercentage = processor.staticPower / totalPower
    staticToDynamicRatio = processor.staticPower / processor.dynamicPower

    print((f"{name}:\n"
           f"  Static Power Percentage = {staticPowerPercentage*100:.3}%\n"
           f"  Static to Dynamic Ratio = {staticToDynamicRatio:.2}\n"))
#+END_SRC

#+RESULTS:
: Pentium 4 Prescott:
:   Static Power Percentage = 10.0%
:   Static to Dynamic Ratio = 0.11
: 
: Core i5 Ivy Bridge:
:   Static Power Percentage = 42.9%
:   Static to Dynamic Ratio = 0.75
: 

* This one is not from the textbook
#+BEGIN_SRC python :results output :exports both
from collections import namedtuple
import math

class Circle:
    @classmethod
    def areaFromDiameter(cls, diameter: float) -> float:
        radius = diameter/2
        return math.pi*radius**2 

    @classmethod
    def circumferenceFromDiameter(cls, diameter: float) -> float:
        return math.pi*diameter


class WaferResults:
    def __init__(self, dieCount, costPerDie):
        self.dieCount = dieCount
        self.costPerDie = costPerDie


class Wafer:
    dieCountStrategy = None
    
    def __init__(self, diameter, cost, dieArea, defectRatio):
        self.diameter = diameter
        self.cost = cost
        self.dieArea = dieArea
        self.defectRatio = defectRatio
        
        self.area = Circle.areaFromDiameter(self.diameter)

    @property
    def goodDieYield(self):
        return 1/(1+(self.defectRatio * self.dieArea/2))**2

    def generateWaferResults(self):
        dieCount = Wafer.dieCountStrategy(self.diameter, self.dieArea)
        costPerDie = self.cost / (dieCount * self.goodDieYield)
        return WaferResults(dieCount, costPerDie)

    
def simpleDieCountStrategy(waferDiameter: float, dieArea: float) -> float:
    return Circle.areaFromDiameter(waferDiameter)/dieArea

def accurateDieCountStrategy(waferDiameter: float, dieArea: float) -> float:
    return simpleDieCountStrategy(waferDiameter, dieArea) - Circle.circumferenceFromDiameter(waferDiameter)/math.sqrt(2*dieArea)

wafer = Wafer(
    diameter = 30,
    cost = 400,
    dieArea = 2.07*1.05,
    defectRatio = 0.020)

print(f"(a) Yield = {wafer.goodDieYield:.3}\n")

Wafer.dieCountStrategy = simpleDieCountStrategy
waferResults = wafer.generateWaferResults()
print(("Simple Approximation: \n"
       f"  (b) Dies per Wafer = {round(waferResults.dieCount)}\n"
       f"  (c) Cost per Die = {waferResults.costPerDie:.3}\n"))

Wafer.dieCountStrategy = accurateDieCountStrategy
waferResults = wafer.generateWaferResults()
print(("More Precise Approximation: \n"
       f"  (b) Dies per Wafer = {round(waferResults.dieCount)}\n"
       f"  (c) Cost per Die = {waferResults.costPerDie:.3}"))
#+END_SRC

#+RESULTS:
: (a) Yield = 0.958
: 
: Simple Approximation: 
:   (b) Dies per Wafer = 325
:   (c) Cost per Die = 1.28
: 
: More Precise Approximation: 
:   (b) Dies per Wafer = 280
:   (c) Cost per Die = 1.49
